Revit 2027 API
BuiltInFailures.FabricFailures.CoverOffsetTooLongTemp Property
 Cover offset is greater than host thickness - support for transient Single Fabric Sheet in editor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CoverOffsetTooLongTemp { get; }
Public Shared ReadOnly Property CoverOffsetTooLongTemp As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CoverOffsetTooLongTemp {
	FailureDefinitionId^ get ();
}
static member CoverOffsetTooLongTemp : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace